Features we'll be creating :-
1. Daily Log Returns
2. Absolute Returns
3. Rolling Volatility
4. volumne change
5. “I engineered return- and volatility-based features using rolling statistics to capture short-, medium-, and long-term market risk behavior.”

In [18]:
import pandas as pd
import numpy as np
df = pd.read_csv(r"C:\Data Science Learning\Projects\Volatility Regime Detection in Stock Returns\data\Processed_data\nifty_processed.csv")
df.head()

         date    close  turnover
0  2014-01-01  6301.65   2015.36
1  2014-01-02  6221.15   5249.79
2  2014-01-03  6211.15   5369.42
3  2014-01-06  6191.45   4722.67
4  2014-01-07  6162.25   5696.60

In [20]:
#Compute Daily Log Returns
df["log_returns"] = np.log(df["close"]/df["close"].shift(1))

In [22]:
df.head(5)

         date    close  turnover  log_returns
0  2014-01-01  6301.65   2015.36          NaN
1  2014-01-02  6221.15   5249.79    -0.012857
2  2014-01-03  6211.15   5369.42    -0.001609
3  2014-01-06  6191.45   4722.67    -0.003177
4  2014-01-07  6162.25   5696.60    -0.004727

In [24]:
#Compute Absolute Returns
df["abs_returns"] = df["log_returns"].abs()

In [26]:
#Rolling Volatility
df["vol_7"] = df["log_returns"].rolling(window=7).std()
df["vol_14"] = df["log_returns"].rolling(window=14).std()
df["vol_30"] = df["log_returns"].rolling(window=30).std()

In [30]:
df.head()

,date,close,turnover,log_returns,abs_returns,vol_7,vol_14,vol_30
0,2014-01-01,6301.65,2015.36,NaN,NaN,NaN,NaN,NaN
1,2014-01-02,6221.15,5249.79,-0.012857,0.012857,NaN,NaN,NaN
2,2014-01-03,6211.15,5369.42,-0.001609,0.001609,NaN,NaN,NaN
3,2014-01-06,6191.45,4722.67,-0.003177,0.003177,NaN,NaN,NaN
4,2014-01-07,6162.25,5696.60,-0.004727,0.004727,NaN,NaN,NaN

In [32]:
#Volumne Change
df["volumn_change"] = df["turnover"].pct_change()

In [36]:
df.head()

,date,close,turnover,log_returns,abs_returns,vol_7,vol_14,vol_30,volumn_change
0,2014-01-01,6301.65,2015.36,NaN,NaN,NaN,NaN,NaN,NaN
1,2014-01-02,6221.15,5249.79,-0.012857,0.012857,NaN,NaN,NaN,1.604889
2,2014-01-03,6211.15,5369.42,-0.001609,0.001609,NaN,NaN,NaN,0.022788
3,2014-01-06,6191.45,4722.67,-0.003177,0.003177,NaN,NaN,NaN,-0.120451
4,2014-01-07,6162.25,5696.60,-0.004727,0.004727,NaN,NaN,NaN,0.206224

In [44]:
#Drop Nans from rolling windows
df = df.dropna().reset_index(drop=True)
df.head()

,date,close,turnover,log_returns,abs_returns,vol_7,vol_14,vol_30,volumn_change
0,2014-02-12,6084.00,5351.08,0.003507,0.003507,0.002187,0.007891,0.007648,0.015616
1,2014-02-13,6001.10,5037.18,-0.013720,0.013720,0.006368,0.008009,0.007694,-0.058661
2,2014-02-14,6048.35,5539.70,0.007843,0.007843,0.006945,0.006616,0.007869,0.099762
3,2014-02-17,6073.30,4455.65,0.004117,0.004117,0.007051,0.006753,0.007908,-0.195687
4,2014-02-18,6127.10,4592.38,0.008819,0.008819,0.007594,0.007206,0.008052,0.030687

In [46]:
df.to_csv(r"C:\Data Science Learning\Projects\Volatility Regime Detection in Stock Returns\data\03_Feature_Extraction\nifty_features.csv",index=False)